{
  "ResumeExpierenceData": [
    {
      "logo": "5",
      "companyName": "Adobe",
      "title": "Solution Architect, March 2018-Present",
      "location": "San Jose, CA",
      "description": "I started at Adobe as a Solution Architect 1 as a contractor. During this time, I learned the basics of our Adobe Sign APIs. I was invovled in daily customer meetings as a tehcnical SME. What lead to my FTE conversion was the development of Sign User Sync which I developed in Python. I designed a process which allowed for user/group management between a Lightweight Directory Access Protocol into our Adobe Sign Neptune Console. I then expanded it to work for Azure AD as well as our Adobe Admin Console. I was then converted to a FTE as a Solution Architect 3. Another major acheivement was when I found a product gap that our competitors offered that we didn't. I then created a Dynamic Workflow Tool leveraging HTML, CSS, JavaScript, React, and running on ExpressJS. This application connected to our API and leveraged our workflow engine. This tool allowed our customers to have the ability for dynamic routings and exposed their internal workflows to external users."
    },
    {
      "logo": "4",
      "companyName": "Nutanix",
      "title": "Support & Client Platform Engineer, October 2016 - March 2018",
      "location": "San Jose, CA",
      "description": "I intially started as an IT intern at Nutanix. Upon graduation, I was offered a full time position as a Support & Client Platform Engineer. On a day to day basis, I would help with supporting tickets within ServiceNow. I wrote scriptes within service now to help collect data for asset management tracking on a global scale. Often time I would try to find automated process to help reduced the amount of work needed for our IT team. I was invovled in helping to design scripts to move our current LanDesk deployment system to a one touch deployment platform. The improved deployment system allowed us to deploy over six times the amount of our current laptop within one go."
    },
    {
      "logo": "3",
      "companyName": "Santa Clara Valley Medical Center",
      "title": "Process Improvement Intern, Feburary 2017 - May 2017",
      "location": "San Jose, CA",
      "description": "During my final semester at San Jose State University as a Senior Industrial & Systems Engineering student, I was assigned to Santa Clara Valley Medical Center (SCVMC). SCVMC was on the verge of finishing construction on its new Sobrato Pavilion. I was tasked to design an efficient process from moving patients from the current Emergency Room to their respective ward in the Sobrato Pavilion. I was involved in collecting environmental data and consulted with different practitioners to get a better understanding of staff per shifts, equipments, and routes. After collecting the needed data, I provided a simulation of the overall process flow. The simulation provided the most efficent route, the optimal number of staff per shifts, and the correct amount of equipments needed. Not only did my recommendation help increase efficenty, I provded a finical analysis which would help saved over $200,000, which would eventually be distrubted into future equipments and staffing rotations."
    },
    {
      "logo": "2",
      "companyName": "Kaiser Permanente",
      "title": "Process Improvement Intern, August 2016 - December 2016",
      "location": "San Jose, CA",
      "description": "As an Industrial & Systems Engineer student in my first Senior semester at San Jose State University, I was assigned to Kaiser Permanente for a senior capstone project. During this time, I was a Process Improvement Intern. I was involved in analyzing their current Multidisplinary Rounds (MDR) data. By analyzing their dataset, I was able to provide statistical analysis on each phase of their MDR and provide recommendations on how to improve their process and help eliminate downtime. I was able to provide a strategy to help improve efficiency by up to 25%. The outcome of my project allowed for other opportunities to open up within Kaiser for other senior capstone projects."
    },
    {
      "logo": "1",
      "companyName": "ExactBid",
      "title": "IT Intern, August 2015 - October 2016",
      "location": "San Jose, CA",
      "description": "My first internship and real-world experience in tech. I was an IT intern and was thought the fundamentals of IT. I started with tier 1 support and later moved on to handling more complex tickets. I managed the entire company assets and made sure everything was up to date within LanSweeper. I developed an onboarding form to help ease the bottleneck for HR. The form was built using PHP, HTML, CSS, and Bootstrap."
    }
  ]
}
